#+title: Using a user-defined random number generator with the standalone Rmath library
#+author: Mark Clements

#+options: toc:nil num:nil

** Introduction and example with static linking

The default random number generator with the [[https://cran.r-project.org/doc/manuals/r-release/R-admin.html#The-standalone-Rmath-library][standalone Rmath library]] is the Marsaglia-multicarry generator. This random number generator does not have good properties and it would be useful to use another random number generator (e.g. Mersenne Twister or RngStream). The =R Installation and Administration= manual, in the section "The standalone Rmath library", states that:

#+begin_example
A little care is needed to use the random-number routines. You will need to supply the uniform random number generator

    double unif_rand(void)

or use the one supplied (and with a shared library or DLL you may have to use the one supplied, which is the Marsaglia-multicarry with an entry point

    set_seed(unsigned int, unsigned int)

to set its seeds). 
#+end_example

I interpret this to mean that we /cannot/ use a user-defined random number generator with "a shared library or DLL", which suggests using static linking. 

*Question: are there any good examples of re-defining unif_rand() with the standalone Rmath library?*

As an example, we could set up a file =test.c=:

#+begin_src C :tangle test.c :eval no :exports code
  // test.c
  #define MATHLIB_STANDALONE
  #include <Rmath.h>
  #include <stdio.h>
  
  double unif_rand(void) { return 0.5; }
  
  int main() {
    printf("%f\n", unif_rand());
    printf("%f\n", runif(0, 1));
    return 0;
  }
#+end_src

#+RESULTS:

If we compile using =-static=, then we get the correct result (two values of 0.5):

#+begin_src sh :results output :exports both
  gcc -static -o test test.c -lRmath -lm
  ./test
#+end_src

#+RESULTS:
: 0.500000
: 0.500000

*Question: does this code work for other users?* 

However, if we compile without using =-static=, then we get the correct value for =unif_rand()=, but =runif(0.0,1.0)= does not use the user-defined =unif_rand()= function:

#+begin_src sh :results output :exports both
  gcc -o test test.c -lRmath -lm
  ./test
#+end_src

#+RESULTS:
: 0.500000
: 0.102089

** Issue with =[dpqr]wilcox=

The static linking leads to a linking issue when we use the =[dpqr]wilcox= functions.

To show that these functions work well without redefining the =unif_rand()= function:

#+begin_src C :tangle test2.c :eval no :exports code
  // test2.c
  #define MATHLIB_STANDALONE
  #include <Rmath.h>
  #include <stdio.h>
  int main() {
    printf("%f\n", unif_rand());
    printf("%f\n", runif(0, 1));
    printf("%f\n", dwilcox(100, 10, 20, 0));
    printf("%f\n", pnorm(1.96, 0, 1, 1, 0));
    return 0;
  }
#+end_src

#+begin_src sh :results output :exports both
  gcc -o test2 test2.c -lRmath -lm
  ./test2
#+end_src

#+RESULTS:
: 0.102089
: 0.854157
: 0.017240
: 0.975002

These numbers are consistent with R:

#+begin_src R :results output :exports both
  RNGkind("Marsaglia-Multicarry")
  .Random.seed = c(10401L, 1234L, 5678L) # default seeds
  runif(2)
  dwilcox(100, 10, 20)
  pnorm(1.96)
#+end_src

#+RESULTS:
: [1] 0.1020891 0.8541567
: [1] 0.01723983
: [1] 0.9750021


However, if we now provide a user-defined definition for =unif_rand()=: 

#+begin_src C :tangle test3.c :eval no :exports code
  // test3.c
  #define MATHLIB_STANDALONE
  #include <Rmath.h>
  #include <stdio.h>
  
  double unif_rand(void) { return 0.5; }
  void set_seed(unsigned int a,  unsigned int b) { }
  
  int main() {
    printf("%f\n", unif_rand());
    printf("%f\n", runif(0, 1));
    printf("%f\n", dwilcox(100, 10, 20, 0));
    printf("%f\n", pnorm(1.96, 0, 1, 1, 0));
    return 0;
  }
#+end_src

And then compile with static linking:

#+begin_src sh :results output :exports both :prologue "exec 2>&1" :epilogue ":"
  gcc -static -o test3 test3.c -lRmath -lm
#+end_src

#+RESULTS:
: /usr/bin/ld: /usr/lib/gcc/x86_64-linux-gnu/11/../../../../lib/libRmath.a(std_unif.o): in function `set_seed':
: (.text+0x0): multiple definition of `set_seed'; /tmp/ccgXiyS9.o:test3.c:(.text+0x1c): first defined here
: /usr/bin/ld: /usr/lib/gcc/x86_64-linux-gnu/11/../../../../lib/libRmath.a(std_unif.o): in function `unif_rand':
: (.text+0x40): multiple definition of `unif_rand'; /tmp/ccgXiyS9.o:test3.c:(.text+0x0): first defined here
: collect2: error: ld returned 1 exit status
: sh: 3: ./test3: not found

If we remove the call to =dwilcox=, then all is well:

#+begin_src C :tangle test4.c :eval no :exports code
  // test4.c
  #define MATHLIB_STANDALONE
  #include <Rmath.h>
  #include <stdio.h>
  
  double unif_rand(void) { return 0.5; }
  
  int main() {
    printf("%f\n", unif_rand());
    printf("%f\n", runif(0, 1));
    printf("%f\n", pnorm(1.96, 0, 1, 1, 0));
    return 0;
  }
#+end_src

And then compile with static linking:

#+begin_src sh :results output :exports both
  gcc -static -o test4 test4.c -lRmath -lm
  ./test4
#+end_src

#+RESULTS:
: 0.500000
: 0.500000
: 0.975002

*** Solution

The issue is that =dwilcox()= calls =R_unif_index()=. If we redefine the latter function, then everything compiles:

#+begin_src C :tangle test5.c :eval no :exports code
  // test5.c
  #define MATHLIB_STANDALONE
  #include <Rmath.h>
  #include <stdio.h>
  
  #include <math.h>
  #include <stdint.h>
  //copied from src/nmath/standalone/sunif.c
  //copied from src/main/RNG.c:
  //generate a random non-negative integer < 2 ^ bits in 16 bit chunks
  static double rbits(int bits)
  {
    int_least64_t v = 0;
    for (int n = 0; n <= bits; n += 16) {
      int v1 = (int) floor(unif_rand() * 65536);
      v = 65536 * v + v1;
    }
    // mask out the bits in the result that are not needed
    return (double) (v & ((1L << bits) - 1));
  }
  double R_unif_index(double dn)
  {
    // rejection sampling from integers below the next larger power of two
    if (dn <= 0)
      return 0.0;
    int bits = (int) ceil(log2(dn));
    double dv;
    do { dv = rbits(bits); } while (dn <= dv);
    return dv;
  }
  
  double unif_rand(void) { return 0.5; }
  void set_seed(unsigned int seed1, unsigned int seed2) { }

  int main() {
    printf("%f\n", unif_rand());
    set_seed(1234, 5678);
    printf("%f\n", runif(0, 1));
    printf("%f\n", pnorm(1.96, 0, 1, 1, 0));
    printf("%f\n", dwilcox(100, 10, 20, 0));
    printf("%f\n", pwilcox(100, 10, 20, 0, 0));
    printf("%f\n", qwilcox(0.5, 10, 20, 0, 0));
    printf("%f\n", rwilcox(10, 20));
    return 0;
  }
#+end_src


#+begin_src sh :results output :exports both
  gcc -static -o test5 test5.c -lRmath -lm
  ./test5
#+end_src

#+RESULTS:
: 0.500000
: 0.500000
: 0.975002
: 0.017240
: 0.491380
: 100.000000
: 190.000000

** Lessons
- There are no good examples of using a user-defined uniform random number generator for the standalone Rmath library.
- It is necessary to replace unif_rand(), set_seed() and R_unif_index() to avoid linking problems.
- 
